In [88]:
import pandas as pd

In [89]:
uri = pd.read_csv("./num_1/uriage.csv")

uri.head()

      purchase_date item_name  item_price customer_name
0  2019-06-13 18:02       상품A       100.0           김가온
1  2019-07-13 13:05     상 품 S         NaN           김우찬
2  2019-05-11 19:42     상 품 a         NaN           김유찬
3  2019-02-12 23:40       상품Z      2600.0           김재현
4   2019-04-22 3:09       상품a         NaN           김강현

In [90]:
uri.columns = ["구입날짜", "상품명", "가격", "고객이름"]

uri.head(2)

               구입날짜    상품명     가격 고객이름
0  2019-06-13 18:02    상품A  100.0  김가온
1  2019-07-13 13:05  상 품 S    NaN  김우찬

In [91]:
## item_name 컬럼 내 공백제거

uri["상품명"] = uri["상품명"].str.replace(" ", "")

In [92]:
## item_name 컬럼 내 소문자를 대문자로 변경

uri["상품명"] = uri["상품명"].str.upper()

uri.head()

               구입날짜  상품명      가격 고객이름
0  2019-06-13 18:02  상품A   100.0  김가온
1  2019-07-13 13:05  상품S     NaN  김우찬
2  2019-05-11 19:42  상품A     NaN  김유찬
3  2019-02-12 23:40  상품Z  2600.0  김재현
4   2019-04-22 3:09  상품A     NaN  김강현

In [93]:
uri.isna().sum()    # 데이터프레임 결측치 확인

구입날짜      0
상품명       0
가격      387
고객이름      0
dtype: int64

In [94]:
flg_is_null = uri["가격"].isna()      # item_price의 결측치

uri.loc[flg_is_null, "상품명"].unique()  # item_name 중 결측치를 가진 것

array(['상품S', '상품A', '상품P', '상품N', '상품W', '상품R', '상품I', '상품L', '상품F',
       '상품O', '상품B', '상품C', '상품V', '상품Q', '상품U', '상품K', '상품T', '상품X',
       '상품E', '상품M', '상품G', '상품J', '상품D', '상품H', '상품Y'], dtype=object)

In [95]:
## 상품명이 상품A이고 가격이 결측치가 아닌것들 중 max 값

uri.loc[(~flg_is_null) & (uri["상품명"] == "상품A"), "가격"].max()

100.0

In [96]:
for trg in list(uri.loc[flg_is_null, "상품명"].unique()):                   # 상품명 중 가격이 결측치인 것
    price = uri.loc[(~flg_is_null) & (uri["상품명"] == trg), "가격"].max()  # 가격이 결측치가 아닌 상품의 max 값
    uri["가격"].loc[(flg_is_null) & (uri["상품명"] == trg )] = price

C:\Users\wndgj\AppData\Local\Temp\ipykernel_23380\74074992.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  uri["가격"].loc[(flg_is_null) & (uri["상품명"] == trg )] = price

In [97]:
uri.loc[uri["상품명"] == "상품A"]

                  구입날짜  상품명     가격 고객이름
0     2019-06-13 18:02  상품A  100.0  김가온
2     2019-05-11 19:42  상품A  100.0  김유찬
4      2019-04-22 3:09  상품A  100.0  김강현
6     2019-05-18 19:16  상품A  100.0  김재준
9     2019-01-28 10:47  상품A  100.0  김태윤
...                ...  ...    ...  ...
2875  2019-06-03 17:33  상품A  100.0  김서진
2886  2019-04-25 17:15  상품A  100.0  김강현
2897  2019-05-20 14:05  상품A  100.0  김지안
2951   2019-05-06 2:24  상품A  100.0  김주혁
2973  2019-07-13 21:38  상품A  100.0  김태윤

[139 rows x 4 columns]

In [98]:
## 엑셀 파일 불러오기

kokya = pd.read_excel("./num_1/kokyaku_daicho.xlsx")

kokya.head()

   고객이름  지역                  등록일
0  김 현성  H시  2018-01-04 00:00:00
1  김 도윤  E시                42782
2  김 지한  A시  2018-01-07 00:00:00
3  김 하윤  F시                42872
4  김 시온  E시                43127

In [99]:
kokya["고객이름"].head()

0    김 현성
1    김 도윤
2    김 지한
3    김 하윤
4    김 시온
Name: 고객이름, dtype: object

In [100]:
kokya["고객이름"] = kokya["고객이름"].str.replace(" ", "")
kokya["고객이름"].head()

0    김현성
1    김도윤
2    김지한
3    김하윤
4    김시온
Name: 고객이름, dtype: object

In [101]:
uri_kokya = pd.merge(uri, kokya, on="고객이름", how="left")

uri_kokya

                  구입날짜  상품명      가격 고객이름  지역                  등록일
0     2019-06-13 18:02  상품A   100.0  김가온  C시  2017-01-26 00:00:00
1     2019-07-13 13:05  상품S  1900.0  김우찬  C시  2018-04-07 00:00:00
2     2019-05-11 19:42  상품A   100.0  김유찬  A시  2018-06-19 00:00:00
3     2019-02-12 23:40  상품Z  2600.0  김재현  D시  2018-07-22 00:00:00
4      2019-04-22 3:09  상품A   100.0  김강현  D시  2017-06-07 00:00:00
...                ...  ...     ...  ...  ..                  ...
2994   2019-02-15 2:56  상품Y  2500.0  김정민  B시  2017-07-01 00:00:00
2995   2019-06-22 4:03  상품M  1300.0  김재원  E시  2018-03-31 00:00:00
2996  2019-03-29 11:14  상품Q  1700.0  김지율  B시  2017-03-15 00:00:00
2997  2019-07-14 12:56  상품H   800.0  김승주  E시                43294
2998   2019-07-21 0:31  상품D   400.0  정준기  B시  2017-02-05 00:00:00

[2999 rows x 6 columns]